/*史纲
新文化运动
1、发端于1915年9月陈独秀在上海创办的《新青年杂志》1919年搬去北京
2、开启了思想解放的浪潮
3、让人们认识到了民主和科学
4、为五四运动做铺垫

十月革命在中国的传播
1、十月革命一声炮响，为中国送来了马克思主义
2、中国和俄国国情相似，马克思主义引起了中国积极分子的注意
3、俄国号召反对帝国主义，并以平等的新的态度对待中国
4、十月革命中俄国工人、农民和士兵群众的广泛发动并获得胜利的事实
5、在中国积极分子对比其他社会主义之后，最终选择了马克思主义
（李大钊第一本《我的马克思主义》，马克思、工人阶级登上历史舞台）

五四运动
1919年发动，为中国共产党作了思想上干部上的准备

中国共产党的创建及其意义
（双半社会、其他努力都失败、十月革命、马克思主义、初心和使命、站起来富起来强起来）
1、1840年鸦片战争以后，中国陷入了半殖民地半封建主义的社会，农民阶级、资本主义都曾试图发动救亡图存的运动，但都以失败告终
2、十月革命为中国送来马克思主义，马克思主义和工人的结合运动中，中国共产党应运而生。
3、中国共产党人的初心和使命，就是为中华人民谋幸福，为中华人民谋复兴
4、中国共产党的建立，是中华民族发展史上的开天辟地的大事变。从此，中国人民有了一个先进的坚强的政党作为领导核心，踏上了民族独立，自身解放的道路，
开启了国家富强、人民富裕的历史正常。（中国人民就此站起来、富起来、强起来了。）改变了发展的方向和进程、改变了前途和命运、改变了世界发展的趋势和格局

以史为鉴、开创未来
1、必须坚持党的领导
2、必须推进马克思主义中国化
3、必须坚持中国特色社会主义
4、必须为美好生活而奋斗
5、必须构建人类命运共同体

专题二中国共产党的初心使命与中华民族的伟大复兴

建党精神：坚持真理，坚守理想，担当使命，不怕牺牲，英勇斗争，对党忠诚，不负人民（真理理想，初心使命，牺牲斗争，党和人民）

弘扬光荣传统、赓续红色血脉
1、长期奋斗中构建起中国共产党人的精神谱系，锤炼出鲜明的政治品格。历史川流不息，精神代代相传。红色资源是我们党艰辛而辉煌奋斗历程的见证，是最宝贵的精神财富。
2、红色血脉是中国共产党政治本色的集中体现，是新时代中国共产党人的精神力量源泉。回望过往历程，眺望前方征途，我们必须始终赓续红色血脉，用党的奋斗历程和伟大
成就鼓舞斗志、指引方向，用党的光荣传统和优良作风鉴定信念、凝聚力量。把革命先烈打下的红色江山守护好、建设好。

初心和使命：
为中国人民谋幸福、为中华民族谋复兴

实现中华民族伟大复兴进入了不可逆转的历史进程&为了实现中华民族伟大复兴，中国共产党团结带领中国人民创造的伟大成就（四大成就）
1、创造了新民主主义革命的伟大成就，为实现中华民族伟大复兴创造了根本社会条件。
2、创造了社会主义革命和建设的伟大成就，为实现中华民族伟大复兴奠定了根本政治基础前提和制度基础。
3、创造了改革开放和社会主义现代化建设的伟大成就，为实现中华民族伟大复兴提供了充满新的活力的体制保证和快速发展的物质条件。
4、创造了新时代中国特色社会主义的伟大成就，为实现中华民族伟大复兴提供了更为完善的制度保证、更为坚实的物质基础、更为主动的精神力量。

实现中华民族伟大复兴必须继续推进马克思主义中国化（马克思注意行）
1、马克思主义是我们立党立国的根本指导思想

*/


/*思政
说明什么是爱国主义？新时达爱国主义的基本要求是什么？如何做忠诚爱国者？
1、爱国主义体现了人们对自己祖国的深厚感情，揭示了个人对祖国的依存关系，是人们对家园、民族和文化的归属感、认同感、尊严感与荣誉感的统一。
他是调节个人与祖国之间关系的道德要求，政治原则和法律规范，也是中华民族精神的核心。爱国是每个人都应当自觉履行的义务，是对祖国的报答。
2、新时代爱国的要求包括：坚持爱国爱党爱社会主义相统一、维护祖国统一和民族团结、尊重和传承中华民族历史和优秀传统文化、坚持立足中国又面向世界。
3、如何做：维护和推进祖国统一、促进民族团结、增强国家安全意识。

坚持爱国爱党爱社会主义相统一
1、新中国是中国共产党领带的社会主义国家，祖国的命运和党的命运、社会主义的命运密不可分。爱国主义和爱社会主义的统一是中国历史发展的必然结果。
2、社会主义制度的建立，为中国的繁荣发展提供了可靠的保障。社会主义体现着国家、民族、人民的根本利益。“没有共产党就没有新中国”，这是中国的历史和现实真理。
3、坚定拥护中国共产党的领导，是中华民族走向复兴，中国特色社会主义事业走向成功的必然要求，也是新时代爱国主义的必然要求。当代中国，爱国主义的本质就是爱国、爱党
、爱社会主义的高度统一。

弘扬中国精神（时代精神+民族精神）
是什么
是时代精神和民族精神的统一，以爱国主义为核心的民族精神和以改革创新为核心的时代精神，构成了中国精神。

为什么弘扬
中国精神是兴国强国之魂。实现中国梦，必须弘扬中国精神。中国精神是凝聚中国力量的纽带、是激发创新的精神动力、是推进复兴的精神定力。

伟大民族精神是什么，为什么要坚持？
“四个伟大”：伟大创造精神（推动创新、发展）、伟大奋斗精神（不怕困难，砥砺前行）、伟大团结精神（民族凝聚力）、伟大梦想精神（伟大复兴）。

人生的扣子一开始就要扣好，如何扣好？
扣子->价值观，青年的价值观养成十分重要，
勤学、修德、明辨、笃实（分别说明）

传承中华美德（扬弃）
坚持古为今用、推陈出新的原则，按照是否有利于推动中国特色社会主义事业，是否有利于建设社会主义道德体系，是否有利于培育和践行社会主义核心价值观的标准，为社会
主义提供丰富的道德资源；

改革创新为核心的时代精神（改革创新、从0到1、突破、推陈出新、锐意创新）
改革创新精神体现为突破陈规、大胆探索、敢于创造的思想观念；体现为不甘落后、奋勇争先、追求进步的责任感和使命感；体现为坚忍不拔、自强不息、锐意进取的精神状态。

*/